In [10]:
import pandas as pd

In [25]:
df_comments=pd.read_csv('comments (6).csv')

In [26]:
#deleting unwanted columns
df_comments.drop(['posted date','emoji used','Hashtags used count'],axis=1,inplace=True)
#renaming columns

In [27]:
#renaming columns
df_comments.rename(columns={'User  id':'user_id','comment':'comment_text','Photo id':'photo_id','created Timestamp':'created_at'},inplace=True)

In [28]:
df_comments['created_at'] = pd.to_datetime(df_comments['created_at'], format='%d-%m-%Y %H:%M')

In [29]:
df_comments.set_index('id', inplace=True)

In [453]:
follows = pd.read_csv("follows (1).csv")

In [30]:
df_comments.head()

              comment_text  user_id  photo_id          created_at
id
1          unde at dolorem        2         1 2023-04-13 08:04:00
2          quae ea ducimus        3         1 2023-04-13 08:04:00
3       alias a voluptatum        5         1 2023-04-13 08:04:00
4     facere suscipit sunt       14         1 2023-04-13 08:04:00
5   totam eligendi quaerat       17         1 2023-04-13 08:04:00

In [202]:
# # import packages
# import psycopg2
# import psycopg2.extras as extras
# import pandas as pd
  
  
# def execute_values(conn, df, table):
  
#     tuples = [tuple(x) for x in df.to_numpy()]
  
#     cols = ','.join(list(df.columns))
  
#     # SQL query to execute
#     query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
#     cursor = conn.cursor()
#     try:
#         extras.execute_values(cursor, query, tuples)
#         conn.commit()
#     except (Exception, psycopg2.DatabaseError) as error:
#         print("Error: %s" % error)
#         conn.rollback()
#         cursor.close()
#         return 1
#     print("execute_values() done")
#     cursor.close()
  
  
# # establishing connection
# conn = psycopg2.connect(
#     database="Airlines_Database",
#     user='postgres',
#     password='Merabhola34@',
#     host='127.0.0.1',
#     port='5432'
# )
# sql = '''CREATE TABLE airlines_final1(id int ,day
# char(20) ,airline char(20),destination char(20));'''
  
# # creating a cursor
# cursor = conn.cursor()
# cursor.execute(sql)
# data = follows
  
# data = data[["follower_id", "followee", "created_at"]]
  
# # using the function defined
# execute_values(conn, data, 'follows')

In [471]:
follows=pd.read_csv('follows (3).csv')
follows.drop(['is follower active','followee Acc status'],axis=1,inplace=True)

In [472]:
follows.rename(columns={'follower':'follower_id','followee':'followee_id','created time':'created_at'},inplace=True)

In [473]:
follows.set_index('follower_id', inplace=True)

In [476]:
follows.head()

             followee           created_at
follower_id
2                    1 2023-04-13 08:04:00
2                    3 2023-04-13 08:04:00
2                    4 2023-04-13 08:04:00
2                    5 2023-04-13 08:04:00
2                    6 2023-04-13 08:04:00

In [474]:

follows['created_at'] = pd.to_datetime(follows['created_at'], format='%d-%m-%Y %H:%M')

In [31]:
df_likes = pd.read_csv('likes (3).csv')

In [35]:
df_likes.set_index('user_id', inplace=True)

In [445]:
# df_likes.set_index('user_id', inplace=True)
print(df_likes.shape)

(8782, 4)

In [32]:
df_likes.drop(['following or not','like type'],axis=1,inplace=True)

In [33]:
df_likes.rename(columns={'user ':'user_id', 'photo':'photo_id','created time':'created_at'},inplace=True)

In [34]:

df_likes['created_at'] = pd.to_datetime(df_likes['created_at'], format='%d-%m-%Y %H:%M')

In [44]:
df_photo_tags = pd.read_csv('photo_tags.csv')

In [437]:

df_likes['user_id'] = df_likes['user '].astype(int)

In [45]:
df_photo_tags.drop(['user id'],axis=1,inplace=True)

In [46]:
df_photo_tags.rename(columns={'photo':'photo_id','tag ID':'tag_id'},inplace=True)

In [515]:
# df_photo_tags['created_at'] = pd.to_datetime(df_photo_tags['created_at'], format='%d-%m-%Y %H:%M')

In [47]:
df_photo_tags.set_index('photo_id', inplace=True)

In [48]:
df_photo_tags.head()

          tag_id
photo_id
1             13
1             17
1             18
1             19
1             21

In [19]:
df_photos = pd.read_csv('photos.csv')

In [24]:
df_photos.head()

               image_url  user_id          created_at
id
1      http://elijah.biz        1 2023-04-13 08:04:00
2     https://shanon.org        1 2023-04-13 08:04:00
3       http://vicky.biz        1 2023-04-13 08:04:00
4       http://oleta.net        1 2023-04-13 08:04:00
5   https://jennings.biz        1 2023-04-13 08:04:00

In [20]:
df_photos.drop(['Insta filter used','photo type'],axis=1,inplace=True)

In [21]:
df_photos.rename(columns={'image link':'image_url','user ID':'user_id','created dat':'created_at'},inplace=True)

In [23]:
df_photos.set_index('id', inplace=True)

In [22]:
df_photos['created_at'] = pd.to_datetime(df_photos['created_at'], format='%d-%m-%Y %H:%M')

In [339]:
df_photos.head()

               image_url  user_id          created_at
id
1      http://elijah.biz        1 2023-04-13 08:04:00
2     https://shanon.org        1 2023-04-13 08:04:00
3       http://vicky.biz        1 2023-04-13 08:04:00
4       http://oleta.net        1 2023-04-13 08:04:00
5   https://jennings.biz        1 2023-04-13 08:04:00

In [37]:
tags = pd.read_csv('tags.csv')

In [38]:
tags.drop(['location'],axis=1,inplace=True)

In [41]:
tags['created_at'] = pd.to_datetime(tags['created_at'], format='%d-%m-%Y %H:%M')

In [40]:
tags.rename(columns={'tag text':'tag_name','created time':'created_at'},inplace=True)

In [42]:
tags.set_index('id', inplace=True)

In [12]:
df_users = pd.read_csv('users.csv')

In [43]:
tags.head()

       tag_name          created_at
id
1        sunset 2023-04-13 08:04:00
2   photography 2023-04-13 08:04:00
3       sunrise 2023-04-13 08:04:00
4     landscape 2023-04-13 08:04:00
5          food 2023-04-13 08:04:00

In [13]:
df_users.drop(['private/public','post count','Verified status'],axis=1,inplace=True)

In [14]:
df_users.rename(columns={'name':'username','created time':'created_at'},inplace=True)

In [16]:
df_users.set_index('id', inplace=True)

In [15]:
df_users['created_at'] = pd.to_datetime(df_users['created_at'], format='%d-%m-%Y %H:%M')

In [17]:
df_users.head()

         username          created_at
id
1   Kenton_Kirlin 2017-02-16 18:22:00
2   Andre_Purdy85 2017-04-02 17:11:00
3   Harley_Lind18 2017-02-21 11:12:00
4   Arely_Bogan63 2016-08-13 01:28:00
5   Aniya_Hackett 2016-12-07 01:04:00

In [221]:
df_tags.head()

   id     tag_name        created_at
0   1       sunset  13-04-2023 08:04
1   2  photography  13-04-2023 08:04
2   3      sunrise  13-04-2023 08:04
3   4    landscape  13-04-2023 08:04
4   5         food  13-04-2023 08:04

In [222]:
df_photos.head()

   id             image_url  user_id      created_date
0   1     http://elijah.biz        1  13-04-2023 08:04
1   2    https://shanon.org        1  13-04-2023 08:04
2   3      http://vicky.biz        1  13-04-2023 08:04
3   4      http://oleta.net        1  13-04-2023 08:04
4   5  https://jennings.biz        1  13-04-2023 08:04

In [223]:
df_photo_tags.head()

   photo_id  tag_id
0         1      13
1         1      17
2         1      18
3         1      19
4         1      21

In [36]:
df_likes.head()

         photo_id          created_at
user_id
2               1 2023-04-13 08:04:00
2               4 2023-04-13 08:04:00
2               8 2023-04-13 08:04:00
2               9 2023-04-13 08:04:00
2              10 2023-04-13 08:04:00

In [386]:
follows.head()

,follower,followee,created time,is follower active,followee Acc status
0,2,1,13-04-2023 08:04,1,Private
1,2,3,13-04-2023 08:04,0,private
2,2,4,13-04-2023 08:04,0,public
3,2,5,13-04-2023 08:04,0,private
4,2,6,13-04-2023 08:04,1,private

In [226]:
df_comments.head()

   id            comment_text  user_id  photo_id        created_at
0   1         unde at dolorem        2         1  13-04-2023 08:04
1   2         quae ea ducimus        3         1  13-04-2023 08:04
2   3      alias a voluptatum        5         1  13-04-2023 08:04
3   4    facere suscipit sunt       14         1  13-04-2023 08:04
4   5  totam eligendi quaerat       17         1  13-04-2023 08:04

In [4]:
import psycopg2
import numpy as np
# Since we want to benchmark the efficiency of each insert strategy
from timeit import default_timer as timer

In [5]:
param_dic = {
    "host"      : "localhost",
    "database"  : "InstagramInsights",
    "user"      : "myuser1",
    "password"  : "Passw0rd1"
}

In [6]:
import sys
def connect(params_dic):
    """ Connect to the PostgreSQL database server """
    conn = None
    try:
        # connect to the PostgreSQL server
        print('Connecting to the PostgreSQL database...')
        conn = psycopg2.connect(**params_dic)
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        sys.exit(1) 
    print("Connection successful")
    return conn

In [7]:
conn = connect(param_dic)

Connecting to the PostgreSQL database...
Connection successful

In [317]:
# create_table_query = """
#     CREATE TABLE IF NOT EXISTS df_users (
#         id SERIAL PRIMARY KEY,
#         username VARCHAR(255) UNIQUE NOT NULL,
#         created_at TIMESTAMP DEFAULT NOW()
#     )
# """

In [8]:
def execute_query(conn, query):
    """ Execute a single query """
    
    ret = 0 # Return value
    cursor = conn.cursor()
    try:
        cursor.execute(query)
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1

    # If this was a select query, return the result
    if 'select' in query.lower():
        ret = cursor.fetchall()
    cursor.close()
    return ret

In [319]:
df_users.head()

         username          created_at
id
1   Kenton_Kirlin 2017-02-16 18:22:00
2   Andre_Purdy85 2017-04-02 17:11:00
3   Harley_Lind18 2017-02-21 11:12:00
4   Arely_Bogan63 2016-08-13 01:28:00
5   Aniya_Hackett 2016-12-07 01:04:00

In [18]:
from io import StringIO

def copy_from_stringio(conn, df, table):
    """
    Here we are going save the dataframe in memory 
    and use copy_from() to copy it to the table
    """
    # save dataframe to an in memory buffer
    buffer = StringIO()
    
    df.to_csv(buffer, index_label = 'id',header=False)
    buffer.seek(0)
    
    cursor = conn.cursor()
    try:
        cursor.copy_from(buffer, table, sep=",")
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1
    print("copy_from_stringio() done")
    cursor.close()


# Run the execute_many strategy
copy_from_stringio(conn, df_users, 'df_users')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from df_users;")

Error: duplicate key value violates unique constraint "df_users_pkey"
DETAIL:  Key (id)=(1) already exists.
CONTEXT:  COPY df_users, line 1

[(100,)]

In [340]:
copy_from_stringio(conn, df_photos, 'df_photos')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from df_photos;")

copy_from_stringio() done

[(257,)]

In [369]:
copy_from_stringio(conn, df_comments, 'df_comments')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from df_comments;")

copy_from_stringio() done

[(7467,)]

In [452]:
copy_from_stringio(conn, df_likes, 'df_likes')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from df_likes;")

copy_from_stringio() done

[(8782,)]

In [478]:
copy_from_stringio(conn, follows, 'follows')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from follows;")

copy_from_stringio() done

[(7623,)]

In [498]:
copy_from_stringio(conn, tags, 'tags')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from tags;")

copy_from_stringio() done

[(21,)]

In [519]:
copy_from_stringio(conn, df_photo_tags, 'df_photo_tags')
#copy_from_stringio() done
# Check that the values were indeed inserted
execute_query(conn, "select count(*) from df_photo_tags;")

copy_from_stringio() done

[(501,)]

In [532]:
#finding five oldes subscribers
execute_query(conn, "SELECT * FROM df_users order by created_at limit 5;")

[(80, 'Darby_Herzog', datetime.datetime(2016, 5, 6, 0, 14)),
 (67, 'Emilio_Bernier52', datetime.datetime(2016, 5, 6, 13, 4)),
 (63, 'Elenor88', datetime.datetime(2016, 5, 8, 1, 30)),
 (95, 'Nicole71', datetime.datetime(2016, 5, 9, 17, 30)),
 (38, 'Jordyn.Jacobson2', datetime.datetime(2016, 5, 14, 7, 56))]

In [545]:
# Error: syntax error at or near "*"
# LINE 1: SELECT * FROM * from df_users order by created_at;
#what day of the week most users register on ?

In [544]:
execute_query(conn, "SELECT to_char(created_at, 'Day') AS day_of_week, count(*) as total FROM df_users GROUP BY day_of_week ORDER BY total DESC;")

[('Thursday ', 16),
 ('Sunday   ', 16),
 ('Friday   ', 15),
 ('Monday   ', 14),
 ('Tuesday  ', 14),
 ('Wednesday', 13),
 ('Saturday ', 12)]

In [546]:
execute_query(conn, "select username from df_users left join df_photos on df_users.id = df_photos.user_id where df_photos.id is null;")

[('Tierra.Trantow',),
 ('Mike.Auer39',),
 ('Jessyca_West',),
 ('Julien_Schmidt',),
 ('Pearl7',),
 ('Nia_Haag',),
 ('Bartholome.Bernhard',),
 ('Bethany20',),
 ('Rocio33',),
 ('Aniya_Hackett',),
 ('Maxwell.Halvorson',),
 ('Franco_Keebler64',),
 ('Darby_Herzog',),
 ('Janelle.Nikolaus81',),
 ('Esther.Zulauf61',),
 ('Esmeralda.Mraz57',),
 ('Hulda.Macejkovic',),
 ('Mckenna17',),
 ('Duane60',),
 ('Ollie_Ledner37',),
 ('Linnea59',),
 ('Morgan.Kassulke',),
 ('David.Osinski47',),
 ('Leslie67',),
 ('Jaclyn81',),
 ('Kasandra_Homenick',)]

In [49]:
# average number of photos posted by a user
execute_query(conn, "select(select count(*) from df_photos)/(select count(*) from df_users);")

[(2,)]

In [52]:
execute_query(conn, "SELECT df_users.username, COUNT(*) AS num_likes FROM df_users INNER JOIN df_likes ON df_users.id = df_likes.user_id GROUP BY df_users.username HAVING COUNT(*) = (SELECT COUNT(*) FROM df_photos);")

[('Leslie67', 257),
 ('Mike.Auer39', 257),
 ('Rocio33', 257),
 ('Janelle.Nikolaus81', 257),
 ('Duane60', 257),
 ('Nia_Haag', 257),
 ('Aniya_Hackett', 257),
 ('Ollie_Ledner37', 257),
 ('Mckenna17', 257),
 ('Jaclyn81', 257),
 ('Maxwell.Halvorson', 257),
 ('Bethany20', 257),
 ('Julien_Schmidt', 257)]

In [53]:
# users who have liked every single photo
execute_query(conn, "SELECT df_users.username, COUNT(*) AS num_likes FROM df_users INNER JOIN df_likes ON df_users.id = df_likes.user_id GROUP BY df_users.username HAVING COUNT(*) = (SELECT COUNT(*) FROM df_photos);")

[('Leslie67', 257),
 ('Mike.Auer39', 257),
 ('Rocio33', 257),
 ('Janelle.Nikolaus81', 257),
 ('Duane60', 257),
 ('Nia_Haag', 257),
 ('Aniya_Hackett', 257),
 ('Ollie_Ledner37', 257),
 ('Mckenna17', 257),
 ('Jaclyn81', 257),
 ('Maxwell.Halvorson', 257),
 ('Bethany20', 257),
 ('Julien_Schmidt', 257)]

In [54]:
# most used tags
execute_query(conn, "select tags.tag_name, count(*) as total from tags inner join df_photo_tags on  tags.id = df_photo_tags.tag_id group by tags.id order by total desc limit 10;")

[('smile', 59),
 ('beach', 42),
 ('party', 39),
 ('fun', 38),
 ('concert', 24),
 ('lol', 24),
 ('food', 24),
 ('hair', 23),
 ('happy', 22),
 ('dreamy', 20)]

In [55]:
#users who have never commented on a photo
execute_query(conn, "select username from df_users left join df_comments on df_users.id = df_comments.user_id where df_comments.comment_text is null;")

[('Tierra.Trantow',),
 ('Jessyca_West',),
 ('Pearl7',),
 ('Florence99',),
 ('Bartholome.Bernhard',),
 ('Donald.Fritsch',),
 ('Franco_Keebler64',),
 ('Darby_Herzog',),
 ('Mariano_Koch3',),
 ('Esther.Zulauf61',),
 ('Esmeralda.Mraz57',),
 ('Cesar93',),
 ('Hulda.Macejkovic',),
 ('Jaime53',),
 ('Linnea59',),
 ('Eveline95',),
 ('Aurelie71',),
 ('Kenton_Kirlin',),
 ('Delfina_VonRueden68',),
 ('Morgan.Kassulke',),
 ('David.Osinski47',),
 ('Clint27',),
 ('Kasandra_Homenick',)]

In [56]:
# who could get most likes on a photo
execute_query(conn, "select photo_id, count(*) as num, df_photos.user_id, df_users.username from df_likes inner join df_photos on df_photos.id = df_likes.photo_id inner join df_users on df_photos.user_id = df_users.id group by photo_id, df_photos.user_id, df_users.username order by num desc;")

[(145, 48, 52, 'Zack_Kemmer93'),
 (127, 43, 46, 'Malinda_Streich'),
 (182, 43, 65, 'Adelle96'),
 (123, 42, 44, 'Seth46'),
 (147, 41, 55, 'Meggie_Doyle'),
 (52, 41, 16, 'Annalise.McKenzie16'),
 (192, 41, 72, 'Kathryn80'),
 (61, 41, 20, 'Delpha.Kihn'),
 (256, 41, 100, 'Javonte83'),
 (30, 41, 10, 'Presley_McClure'),
 (174, 41, 63, 'Elenor88'),
 (244, 40, 94, 'Damon35'),
 (13, 40, 3, 'Harley_Lind18'),
 (97, 40, 32, 'Irwin.Larson'),
 (161, 40, 59, 'Cesar93'),
 (153, 40, 58, 'Aurelie71'),
 (119, 39, 43, 'Janet.Armstrong'),
 (62, 39, 22, 'Kenneth64'),
 (199, 39, 77, 'Donald.Fritsch'),
 (144, 39, 52, 'Zack_Kemmer93'),
 (201, 39, 77, 'Donald.Fritsch'),
 (227, 39, 87, 'Rick29'),
 (110, 39, 39, 'Kelsi26'),
 (118, 39, 43, 'Janet.Armstrong'),
 (180, 39, 64, 'Florence99'),
 (66, 39, 23, 'Eveline95'),
 (44, 39, 13, 'Alexandro35'),
 (107, 39, 37, 'Yazmin_Mills95'),
 (100, 39, 33, 'Yvette.Gottlieb91'),
 (205, 39, 78, 'Colten.Harris76'),
 (37, 38, 11, 'Justina.Gaylord27'),
 (162, 38, 59, 'Cesar93'),
 (183, 38, 65, 'Adelle96'),
 (150, 38, 58, 'Aurelie71'),
 (81, 38, 28, 'Dario77'),
 (155, 38, 58, 'Aurelie71'),
 (41, 38, 12, 'Dereck65'),
 (7, 38, 2, 'Andre_Purdy85'),
 (4, 38, 1, 'Kenton_Kirlin'),
 (23, 38, 8, 'Tabitha_Schamberger11'),
 (210, 38, 82, 'Aracely.Johnston98'),
 (197, 38, 77, 'Donald.Fritsch'),
 (196, 38, 73, 'Jaylan.Lakin'),
 (69, 38, 23, 'Eveline95'),
 (63, 38, 23, 'Eveline95'),
 (3, 38, 1, 'Kenton_Kirlin'),
 (169, 38, 61, 'Jayson65'),
 (225, 37, 87, 'Rick29'),
 (43, 37, 13, 'Alexandro35'),
 (230, 37, 88, 'Clint27'),
 (57, 37, 17, 'Norbert_Carroll35'),
 (198, 37, 77, 'Donald.Fritsch'),
 (49, 37, 15, 'Billy52'),
 (16, 37, 4, 'Arely_Bogan63'),
 (71, 37, 23, 'Eveline95'),
 (248, 37, 96, 'Keenan.Schamberger60'),
 (212, 37, 84, 'Alysa22'),
 (59, 37, 19, 'Hailee26'),
 (203, 37, 78, 'Colten.Harris76'),
 (120, 37, 44, 'Seth46'),
 (241, 37, 92, 'Frederik_Rice'),
 (42, 37, 13, 'Alexandro35'),
 (178, 37, 64, 'Florence99'),
 (133, 37, 48, 'Granville_Kutch'),
 (40, 37, 12, 'Dereck65'),
 (87, 37, 29, 'Jaime53'),
 (190, 36, 70, 'Erick5'),
 (17, 36, 6, 'Travon.Waters'),
 (101, 36, 33, 'Yvette.Gottlieb91'),
 (257, 36, 100, 'Javonte83'),
 (28, 36, 9, 'Gus93'),
 (171, 36, 62, 'Ressie_Stanton46'),
 (166, 36, 59, 'Cesar93'),
 (211, 36, 84, 'Alysa22'),
 (113, 36, 42, 'Maya.Farrell'),
 (21, 36, 6, 'Travon.Waters'),
 (85, 36, 29, 'Jaime53'),
 (90, 36, 29, 'Jaime53'),
 (189, 36, 69, 'Karley_Bosco'),
 (2, 36, 1, 'Kenton_Kirlin'),
 (58, 36, 18, 'Odessa2'),
 (186, 36, 67, 'Emilio_Bernier52'),
 (25, 36, 8, 'Tabitha_Schamberger11'),
 (222, 36, 86, 'Delfina_VonRueden68'),
 (53, 36, 16, 'Annalise.McKenzie16'),
 (177, 36, 64, 'Florence99'),
 (56, 36, 17, 'Norbert_Carroll35'),
 (106, 36, 35, 'Lennie_Hartmann40'),
 (116, 36, 43, 'Janet.Armstrong'),
 (206, 35, 78, 'Colten.Harris76'),
 (232, 35, 88, 'Clint27'),
 (137, 35, 51, 'Mariano_Koch3'),
 (48, 35, 15, 'Billy52'),
 (84, 35, 28, 'Dario77'),
 (158, 35, 59, 'Cesar93'),
 (181, 35, 65, 'Adelle96'),
 (24, 35, 8, 'Tabitha_Schamberger11'),
 (14, 35, 4, 'Arely_Bogan63'),
 (82, 35, 28, 'Dario77'),
 (112, 35, 42, 'Maya.Farrell'),
 (103, 35, 33, 'Yvette.Gottlieb91'),
 (234, 35, 88, 'Clint27'),
 (213, 35, 85, 'Milford_Gleichner42'),
 (243, 35, 93, 'Willie_Leuschke'),
 (19, 35, 6, 'Travon.Waters'),
 (204, 35, 78, 'Colten.Harris76'),
 (36, 35, 11, 'Justina.Gaylord27'),
 (136, 35, 50, 'Gerard79'),
 (117, 35, 43, 'Janet.Armstrong'),
 (67, 35, 23, 'Eveline95'),
 (55, 35, 17, 'Norbert_Carroll35'),
 (77, 35, 26, 'Josianne.Friesen'),
 (20, 35, 6, 'Travon.Waters'),
 (126, 35, 46, 'Malinda_Streich'),
 (80, 35, 27, 'Darwin29'),
 (141, 34, 51, 'Mariano_Koch3'),
 (128, 34, 47, 'Harrison.Beatty50'),
 (102, 34, 33, 'Yvette.Gottlieb91'),
 (249, 34, 96, 'Keenan.Schamberger60'),
 (86, 34, 29, 'Jaime53'),
 (46, 34, 13, 'Alexandro35'),
 (221, 34, 86, 'Delfina_VonRueden68'),
 (94, 34, 30, 'Kaley9'),
 (231, 34, 88, 'Clint27'),
 (91, 34, 29, 'Jaime53'),
 (45, 34, 13, 'Alexandro35'),
 (121, 34, 44, 'Seth46'),
 (235, 34, 88, 'Clint27'),
 (200, 34, 77, 'Donald.Fritsch'),
 (217, 34, 86, 'Delfina_VonRueden68'),
 (64, 34, 23, 'Eveline95'),
 (252, 34, 98, 'Imani_Nicolas17'),
 (170, 34, 62, 'Ressie_Stanton46'),
 (173, 34, 63, 'Elenor88'),
 (68, 34, 23, 'Eveline95'),
 (138, 34, 51, 'Mariano_Koch3'),
 (79, 34, 26, 'Josianne.Friesen'),
 (154, 34, 58, 'Aurelie71'),
 (15, 34, 4, 'Arely_Bogan63'),
 (233, 34, 88, 'Clint27'),
 (78, 34, 26, 'Josianne.Friesen'),
 (39, 34, 12, 'Dereck65'),
 (149, 34, 58, 'Aurelie71'),
 (99, 34, 32, 'Irwin.Larson'),
 (98, 34, 32, 'Irwin.Larson'),
 (70, 34, 23, 'Eveline95'),
 (124, 34, 46, 'Malinda_Streich'),
 (209, 34, 82, 'Aracely.Johnston98'),
 (74, 34, 23, 'Eveline95'),
 (134, 34, 50, 'Gerard79'),
 (32, 33, 10, 'Presley_McClure'),
 (148, 33, 56, 'Peter.Stehr0'),
 (125, 33, 46, 'Malinda_Streich'),
 (88, 33, 29, 'Jaime53'),
 (109, 33, 38, 'Jordyn.Jacobson2'),
 (185, 33, 65, 'Adelle96'),
 (29, 33, 9, 'Gus93'),
 (242, 33, 93, 'Willie_Leuschke'),
 (226, 33, 87, 'Rick29'),
 (111, 33, 40, 'Rafael.Hickle2'),
 (11, 33, 3, 'Harley_Lind18'),
 (220, 33, 86, 'Delfina_VonRueden68'),
 (105, 33, 35, 'Lennie_Hartmann40'),
 (245, 33, 95, 'Nicole71'),
 (65, 33, 23, 'Eveline95'),
 (140, 33, 51, 'Mariano_Koch3'),
 (146, 33, 52, 'Zack_Kemmer93'),
 (122, 33, 44, 'Seth46'),
 (152, 33, 58, 'Aurelie71'),
 (72, 33, 23, 'Eveline95'),
 (163, 33, 59, 'Cesar93'),
 (255, 33, 99, 'Alek_Watsica'),
 (157, 33, 59, 'Cesar93'),
 (176, 33, 64, 'Florence99'),
 (75, 33, 26, 'Josianne.Friesen'),
 (76, 32, 26, 'Josianne.Friesen'),
 (60, 32, 19, 'Hailee26'),
 (35, 32, 11, 'Justina.Gaylord27'),
 (164, 32, 59, 'Cesar93'),
 (172, 32, 63, 'Elenor88'),
 (237, 32, 88, 'Clint27'),
 (218, 32, 86, 'Delfina_VonRueden68'),
 (142, 32, 52, 'Zack_Kemmer93'),
 (229, 32, 88, 'Clint27'),
 (219, 32, 86, 'Delfina_VonRueden68'),
 (253, 32, 99, 'Alek_Watsica'),
 (34, 32, 11, 'Justina.Gaylord27'),
 (89, 32, 29, 'Jaime53'),
 (96, 32, 32, 'Irwin.Larson'),
 (114, 32, 42, 'Maya.Farrell'),
 (151, 32, 58, 'Aurelie71'),
 (168, 32, 60, 'Sam52'),
 (54, 31, 16, 'Annalise.McKenzie16'),
 (93, 31, 30, 'Kaley9'),
 (18, 31, 6, 'Travon.Waters'),
 (73, 31, 23, 'Eveline95'),
 (5, 31, 1, 'Kenton_Kirlin'),
 (207, 31, 78, 'Colten.Harris76'),
 (31, 31, 10, 'Presley_McClure'),
 (239, 31, 92, 'Frederik_Rice'),
 (27, 31, 9, 'Gus93'),
 (83, 31, 28, 'Dario77'),
 (254, 31, 99, 'Alek_Watsica'),
 (202, 31, 77, 'Donald.Fritsch'),
 (6, 31, 2, 'Andre_Purdy85'),
 (191, 31, 72, 'Kathryn80'),
 (160, 31, 59, 'Cesar93'),
 (115, 31, 43, 'Janet.Armstrong'),
 (9, 31, 2, 'Andre_Purdy85'),
 (228, 31, 88, 'Clint27'),
 (104, 31, 33, 'Yvette.Gottlieb91'),
 (250, 31, 97, 'Tomas.Beatty93'),
 (167, 31, 60, 'Sam52'),
 (38, 31, 12, 'Dereck65'),
 (187, 31, 67, 'Emilio_Bernier52'),
 (224, 31, 87, 'Rick29'),
 (156, 31, 58, 'Aurelie71'),
 (246, 31, 95, 'Nicole71'),
 (159, 31, 59, 'Cesar93'),
 (184, 30, 65, 'Adelle96'),
 (143, 30, 52, 'Zack_Kemmer93'),
 (26, 30, 9, 'Gus93'),
 (47, 30, 15, 'Billy52'),
 (240, 30, 92, 'Frederik_Rice'),
 (179, 30, 64, 'Florence99'),
 (188, 30, 67, 'Emilio_Bernier52'),
 (236, 30, 88, 'Clint27'),
 (193, 30, 72, 'Kathryn80'),
 (10, 30, 3, 'Harley_Lind18'),
 (216, 30, 86, 'Delfina_VonRueden68'),
 (132, 30, 47, 'Harrison.Beatty50'),
 (135, 29, 50, 'Gerard79'),
 (215, 29, 86, 'Delfina_VonRueden68'),
 (208, 29, 79, 'Katarina.Dibbert'),
 (92, 29, 29, 'Jaime53'),
 (108, 29, 38, 'Jordyn.Jacobson2'),
 (129, 29, 47, 'Harrison.Beatty50'),
 (12, 29, 3, 'Harley_Lind18'),
 (131, 29, 47, 'Harrison.Beatty50'),
 (51, 29, 16, 'Annalise.McKenzie16'),
 (130, 29, 47, 'Harrison.Beatty50'),
 (194, 29, 72, 'Kathryn80'),
 (33, 29, 11, 'Justina.Gaylord27'),
 (165, 29, 59, 'Cesar93'),
 (214, 29, 85, 'Milford_Gleichner42'),
 (251, 28, 97, 'Tomas.Beatty93'),
 (22, 28, 8, 'Tabitha_Schamberger11'),
 (175, 28, 63, 'Elenor88'),
 (247, 28, 96, 'Keenan.Schamberger60'),
 (95, 28, 31, 'Aiyana_Hoeger'),
 (8, 27, 2, 'Andre_Purdy85'),
 (139, 27, 51, 'Mariano_Koch3'),
 (238, 27, 88, 'Clint27'),
 (50, 27, 15, 'Billy52'),
 (195, 26, 72, 'Kathryn80'),
 (1, 25, 1, 'Kenton_Kirlin'),
 (223, 25, 86, 'Delfina_VonRueden68')]

In [57]:
# users rankings by postings from higher to lower
execute_query(conn, "SELECT user_id, COUNT(image_url) AS no_of_photos, RANK() OVER (ORDER BY COUNT(image_url) DESC) AS ranking FROM df_photos GROUP BY user_id ORDER BY no_of_photos DESC;")

[(23, 12, 1),
 (88, 11, 2),
 (59, 10, 3),
 (86, 9, 4),
 (58, 8, 5),
 (29, 8, 5),
 (77, 6, 7),
 (52, 5, 8),
 (26, 5, 8),
 (43, 5, 8),
 (6, 5, 8),
 (64, 5, 8),
 (1, 5, 8),
 (33, 5, 8),
 (47, 5, 8),
 (13, 5, 8),
 (65, 5, 8),
 (78, 5, 8),
 (72, 5, 8),
 (11, 5, 8),
 (51, 5, 8),
 (16, 4, 22),
 (15, 4, 22),
 (87, 4, 22),
 (46, 4, 22),
 (63, 4, 22),
 (9, 4, 22),
 (12, 4, 22),
 (32, 4, 22),
 (44, 4, 22),
 (2, 4, 22),
 (28, 4, 22),
 (8, 4, 22),
 (3, 4, 22),
 (10, 3, 35),
 (4, 3, 35),
 (96, 3, 35),
 (67, 3, 35),
 (92, 3, 35),
 (50, 3, 35),
 (99, 3, 35),
 (42, 3, 35),
 (17, 3, 35),
 (100, 2, 44),
 (82, 2, 44),
 (85, 2, 44),
 (95, 2, 44),
 (62, 2, 44),
 (19, 2, 44),
 (30, 2, 44),
 (97, 2, 44),
 (60, 2, 44),
 (93, 2, 44),
 (84, 2, 44),
 (35, 2, 44),
 (38, 2, 44),
 (94, 1, 57),
 (39, 1, 57),
 (55, 1, 57),
 (27, 1, 57),
 (70, 1, 57),
 (37, 1, 57),
 (40, 1, 57),
 (79, 1, 57),
 (48, 1, 57),
 (31, 1, 57),
 (73, 1, 57),
 (20, 1, 57),
 (98, 1, 57),
 (69, 1, 57),
 (56, 1, 57),
 (61, 1, 57),
 (18, 1, 57),
 (22, 1, 57)]

In [58]:
# total number of users who have posted atleast one time
execute_query(conn, "select distinct username from df_users left join df_photos on df_users.id = df_photos.user_id where df_photos.id is not null;")

[('Delfina_VonRueden68',),
 ('Josianne.Friesen',),
 ('Lennie_Hartmann40',),
 ('Rafael.Hickle2',),
 ('Jayson65',),
 ('Kathryn80',),
 ('Kaley9',),
 ('Granville_Kutch',),
 ('Tabitha_Schamberger11',),
 ('Annalise.McKenzie16',),
 ('Milford_Gleichner42',),
 ('Aiyana_Hoeger',),
 ('Irwin.Larson',),
 ('Harley_Lind18',),
 ('Arely_Bogan63',),
 ('Donald.Fritsch',),
 ('Kelsi26',),
 ('Meggie_Doyle',),
 ('Jaylan.Lakin',),
 ('Javonte83',),
 ('Alysa22',),
 ('Katarina.Dibbert',),
 ('Tomas.Beatty93',),
 ('Eveline95',),
 ('Cesar93',),
 ('Yazmin_Mills95',),
 ('Malinda_Streich',),
 ('Aurelie71',),
 ('Damon35',),
 ('Jaime53',),
 ('Harrison.Beatty50',),
 ('Darwin29',),
 ('Alexandro35',),
 ('Presley_McClure',),
 ('Gerard79',),
 ('Rick29',),
 ('Travon.Waters',),
 ('Kenneth64',),
 ('Ressie_Stanton46',),
 ('Zack_Kemmer93',),
 ('Janet.Armstrong',),
 ('Maya.Farrell',),
 ('Gus93',),
 ('Sam52',),
 ('Keenan.Schamberger60',),
 ('Clint27',),
 ('Alek_Watsica',),
 ('Adelle96',),
 ('Delpha.Kihn',),
 ('Nicole71',),
 ('Elenor88',),
 ('Frederik_Rice',),
 ('Mariano_Koch3',),
 ('Jordyn.Jacobson2',),
 ('Justina.Gaylord27',),
 ('Andre_Purdy85',),
 ('Odessa2',),
 ('Willie_Leuschke',),
 ('Florence99',),
 ('Imani_Nicolas17',),
 ('Colten.Harris76',),
 ('Kenton_Kirlin',),
 ('Yvette.Gottlieb91',),
 ('Dario77',),
 ('Norbert_Carroll35',),
 ('Dereck65',),
 ('Seth46',),
 ('Karley_Bosco',),
 ('Peter.Stehr0',),
 ('Aracely.Johnston98',),
 ('Erick5',),
 ('Emilio_Bernier52',),
 ('Hailee26',),
 ('Billy52',)]

In [59]:
# users who have ever commented
execute_query(conn, "select distinct username from df_users left join df_photos on df_users.id = df_photos.user_id where df_photos.id is not null;")

[('Delfina_VonRueden68',),
 ('Josianne.Friesen',),
 ('Lennie_Hartmann40',),
 ('Rafael.Hickle2',),
 ('Jayson65',),
 ('Kathryn80',),
 ('Kaley9',),
 ('Granville_Kutch',),
 ('Tabitha_Schamberger11',),
 ('Annalise.McKenzie16',),
 ('Milford_Gleichner42',),
 ('Aiyana_Hoeger',),
 ('Irwin.Larson',),
 ('Harley_Lind18',),
 ('Arely_Bogan63',),
 ('Donald.Fritsch',),
 ('Kelsi26',),
 ('Meggie_Doyle',),
 ('Jaylan.Lakin',),
 ('Javonte83',),
 ('Alysa22',),
 ('Katarina.Dibbert',),
 ('Tomas.Beatty93',),
 ('Eveline95',),
 ('Cesar93',),
 ('Yazmin_Mills95',),
 ('Malinda_Streich',),
 ('Aurelie71',),
 ('Damon35',),
 ('Jaime53',),
 ('Harrison.Beatty50',),
 ('Darwin29',),
 ('Alexandro35',),
 ('Presley_McClure',),
 ('Gerard79',),
 ('Rick29',),
 ('Travon.Waters',),
 ('Kenneth64',),
 ('Ressie_Stanton46',),
 ('Zack_Kemmer93',),
 ('Janet.Armstrong',),
 ('Maya.Farrell',),
 ('Gus93',),
 ('Sam52',),
 ('Keenan.Schamberger60',),
 ('Clint27',),
 ('Alek_Watsica',),
 ('Adelle96',),
 ('Delpha.Kihn',),
 ('Nicole71',),
 ('Elenor88',),
 ('Frederik_Rice',),
 ('Mariano_Koch3',),
 ('Jordyn.Jacobson2',),
 ('Justina.Gaylord27',),
 ('Andre_Purdy85',),
 ('Odessa2',),
 ('Willie_Leuschke',),
 ('Florence99',),
 ('Imani_Nicolas17',),
 ('Colten.Harris76',),
 ('Kenton_Kirlin',),
 ('Yvette.Gottlieb91',),
 ('Dario77',),
 ('Norbert_Carroll35',),
 ('Dereck65',),
 ('Seth46',),
 ('Karley_Bosco',),
 ('Peter.Stehr0',),
 ('Aracely.Johnston98',),
 ('Erick5',),
 ('Emilio_Bernier52',),
 ('Hailee26',),
 ('Billy52',)]

In [61]:
execute_query(conn, "SELECT df_users.username, 'Commented on every photo' AS status FROM df_users INNER JOIN df_comments ON df_users.id = df_comments.user_id GROUP BY df_users.username HAVING COUNT(*) = (SELECT COUNT(*) FROM df_comments) UNION SELECT df_users.username, 'Not commented on any photo' AS status FROM df_users LEFT JOIN df_comments ON df_users.id = df_comments.user_id GROUP BY df_users.username HAVING COUNT(df_comments.comment_text) = 0;")

[('Aurelie71', 'Not commented on any photo'),
 ('Bartholome.Bernhard', 'Not commented on any photo'),
 ('Cesar93', 'Not commented on any photo'),
 ('Clint27', 'Not commented on any photo'),
 ('Darby_Herzog', 'Not commented on any photo'),
 ('David.Osinski47', 'Not commented on any photo'),
 ('Delfina_VonRueden68', 'Not commented on any photo'),
 ('Donald.Fritsch', 'Not commented on any photo'),
 ('Esmeralda.Mraz57', 'Not commented on any photo'),
 ('Esther.Zulauf61', 'Not commented on any photo'),
 ('Eveline95', 'Not commented on any photo'),
 ('Florence99', 'Not commented on any photo'),
 ('Franco_Keebler64', 'Not commented on any photo'),
 ('Hulda.Macejkovic', 'Not commented on any photo'),
 ('Jaime53', 'Not commented on any photo'),
 ('Jessyca_West', 'Not commented on any photo'),
 ('Kasandra_Homenick', 'Not commented on any photo'),
 ('Kenton_Kirlin', 'Not commented on any photo'),
 ('Linnea59', 'Not commented on any photo'),
 ('Mariano_Koch3', 'Not commented on any photo'),
 ('Morgan.Kassulke', 'Not commented on any photo'),
 ('Pearl7', 'Not commented on any photo'),
 ('Tierra.Trantow', 'Not commented on any photo')]